shorepine/tulipcc/ports/esp32s3/components/bw_esp_lcd/src/esp_lcd_rgb_panel.c
    // calculate the number of DMA descriptors
    uint8_t bpp = rgb_panel_config->data_width / 8;
    size_t fb_size = rgb_panel_config->timings.h_res * rgb_panel_config->timings.v_res * bpp;
    size_t num_dma_nodes;
    int bounce_bytes = 0;
    if (rgb_panel_config->bounce_buffer_size_px == 0) {
        // No bounce buffers. DMA descriptors need to fit entire framebuffer
        num_dma_nodes = (fb_size + DMA_DESCRIPTOR_BUFFER_MAX_SIZE - 1) / DMA_DESCRIPTOR_BUFFER_MAX_SIZE;
    } else {
        //The FB needs to be an integer multiple of the size of the two bounce buffers
        //combined (so we end on the end of the second bounce buffer). Adjust the size
        //of the bounce buffers if it is not.
        int no_pixels=rgb_panel_config->timings.h_res * rgb_panel_config->timings.v_res;
        bounce_bytes=rgb_panel_config->bounce_buffer_size_px * bpp;
        if (no_pixels % (rgb_panel_config->bounce_buffer_size_px * bpp)) {
            //fprintf(stderr, "remainder of %d %% %d left\n", no_pixels, (rgb_panel_config->bounce_buffer_size_px * bpp));
            //Search for some value that does work. Yes, this is a stupidly simple algo, but it only
            //needs to run on startup.
            for (int a=rgb_panel_config->bounce_buffer_size_px; a>0; a--) {
                if ((no_pixels % (a*bpp))==0) {
                    bounce_bytes = a*bpp;
                    ESP_LOGW(TAG, "Frame buffer is not an integer multiple of bounce buffers.");
                    ESP_LOGW(TAG, "Adjusted bounce buffer size from %d to %d pixels to fix this.",
                            rgb_panel_config->bounce_buffer_size_px, bounce_bytes/bpp);
                    printf("adjusting size from %d to %d\n", rgb_panel_config->bounce_buffer_size_px, bounce_bytes/bpp);
                    break;
                }
            }
        }
        // DMA descriptors need to fit both bounce buffers
        num_dma_nodes = (bounce_bytes + DMA_DESCRIPTOR_BUFFER_MAX_SIZE - 1) / DMA_DESCRIPTOR_BUFFER_MAX_SIZE;
        num_dma_nodes = num_dma_nodes * 2; //as we have two bounce buffers
    }

    // DMA descriptors must be placed in internal SRAM (requested by DMA)
    rgb_panel = heap_caps_calloc(1, sizeof(esp_rgb_panel_t) + num_dma_nodes * sizeof(dma_descriptor_t), MALLOC_CAP_DMA | MALLOC_CAP_INTERNAL);
    ESP_GOTO_ON_FALSE(rgb_panel, ESP_ERR_NO_MEM, err, TAG, "no mem for rgb panel");
    rgb_panel->num_dma_nodes = num_dma_nodes;
    rgb_panel->panel_id = -1;
    rgb_panel->bounce_buffer_size_bytes = bounce_bytes;
    //fprintf(stderr, "%d dma nodes bb is %d\n", num_dma_nodes, bounce_bytes);
    // register to platform
    int panel_id = lcd_com_register_device(LCD_COM_DEVICE_TYPE_RGB, rgb_panel);
    ESP_GOTO_ON_FALSE(panel_id >= 0, ESP_ERR_NOT_FOUND, err, TAG, "no free rgb panel slot");
    rgb_panel->panel_id = panel_id;
    // enable APB to access LCD registers
    periph_module_enable(lcd_periph_signals.panels[panel_id].module);
    periph_module_reset(lcd_periph_signals.panels[panel_id].module);
    // alloc frame buffer
    bool alloc_from_psram = false;
    // fb_in_psram is only an option, if there's no PSRAM on board, we still alloc from SRAM
    if (rgb_panel_config->flags.fb_in_psram) {
#if CONFIG_SPIRAM_USE_MALLOC || CONFIG_SPIRAM_USE_CAPS_ALLOC
        if (esp_spiram_is_initialized()) {
            alloc_from_psram = true;
        }
#endif
    }
    size_t psram_trans_align = rgb_panel_config->psram_trans_align ? rgb_panel_config->psram_trans_align : 64;
    size_t sram_trans_align = rgb_panel_config->sram_trans_align ? rgb_panel_config->sram_trans_align : 4;

    // Was
    /*
    if (alloc_from_psram) {
        // the low level malloc function will help check the validation of alignment
        rgb_panel->fb = heap_caps_aligned_calloc(psram_trans_align, 1, fb_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    } else {
        rgb_panel->fb = heap_caps_aligned_calloc(sram_trans_align, 1, fb_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
    }
    ESP_GOTO_ON_FALSE(rgb_panel->fb, ESP_ERR_NO_MEM, err, TAG, "no mem for frame buffer");
    rgb_panel->psram_trans_align = psram_trans_align;
    rgb_panel->sram_trans_align = sram_trans_align;
    rgb_panel->fb_size = fb_size;
    rgb_panel->flags.fb_in_psram = alloc_from_psram;
    */
    // Now
    rgb_panel->fb_size = fb_size;
    if (!rgb_panel_config->on_bounce_empty) {
        //We need to allocate a framebuffer.
        if (alloc_from_psram) {
            // the low level malloc function will help check the validation of alignment
            rgb_panel->fb = heap_caps_aligned_calloc(psram_trans_align, 1, fb_size, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
        } else {
            rgb_panel->fb = heap_caps_aligned_calloc(sram_trans_align, 1, fb_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
        }
        ESP_GOTO_ON_FALSE(rgb_panel->fb, ESP_ERR_NO_MEM, err, TAG, "no mem for frame buffer");
        rgb_panel->psram_trans_align = psram_trans_align;
        rgb_panel->sram_trans_align = sram_trans_align;
        rgb_panel->flags.fb_in_psram = alloc_from_psram;
    }
    if (rgb_panel->bounce_buffer_size_bytes) {
        //We need to allocate bounce buffers.
        rgb_panel->bounce_buffer[0] = heap_caps_aligned_calloc(sram_trans_align, 1, 
                        rgb_panel->bounce_buffer_size_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
        rgb_panel->bounce_buffer[1] = heap_caps_aligned_calloc(sram_trans_align, 1, 
                        rgb_panel->bounce_buffer_size_bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
    }
    if (rgb_panel_config->on_bounce_empty) {
        rgb_panel->on_bounce_empty = rgb_panel_config->on_bounce_empty;
        rgb_panel->bounce_buffer_cb_user_ctx = rgb_panel_config->bounce_buffer_cb_user_ctx;
    }

    // initialize HAL layer, so we can call LL APIs later
    lcd_hal_init(&rgb_panel->hal, panel_id);
    // set peripheral clock resolution
    ret = lcd_rgb_panel_select_periph_clock(rgb_panel, rgb_panel_config->clk_src);
    ESP_GOTO_ON_ERROR(ret, err, TAG, "select periph clock failed");
    
